Diplom/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom/src/Catalogs/ВКМ_ФизическиеЛица/ВКМ_ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Diplom/src/Documents/ВКМ_НачисленияЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	НачалоМесяца = НачалоМесяца(Объект.Дата);
	КонецМесяца = КонецМесяца(Объект.Дата);
	
	Для каждого СтрНачисление из Объект.ОсновныеНачисления цикл
		
		Если СтрНачисление.ДатаНачала < НачалоМесяца ИЛИ СтрНачисление.ДатаОкончания > КонецМесяца тогда
			Отказ = Истина;
			ТекстСообщения = СтрШаблон("В строке %1 выбранный период не соответствует месяцу документа", 
			СтрНачисление.НомерСтроки);
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ЗаполнитьНаСервере();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено Подразделение. Автоматическое заполнение невозможно!");
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.ОсновныеНачисления.Очистить();
	Объект.ДополнительныеНачисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.ЧасовКОплатеПриход КАК ЧасовКОплатеПриход,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплатеПриход
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
		|		ПО ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник = ВКМ_ФизическиеЛица.Ссылка
		|ГДЕ
		|	ВКМ_ФизическиеЛица.Подразделение = &Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ФизическиеЛица.Ссылка КАК Сотрудник,
		|	ВКМ_ФизическиеЛица.ГрафикРаботы КАК ГрафикРаботы
		|ИЗ
		|	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
		|ГДЕ
		|	ВКМ_ФизическиеЛица.Подразделение = &Подразделение";
	
	НачалоМесяца = НачалоМесяца(НачалоДня(Объект.Дата));
	КонецМесяца = КонецМесяца(КонецДня(Объект.Дата));
	
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаДополнительныеНачисления = МассивРезультатов[0].Выбрать();
	ВыборкаОсновныеНачисления = МассивРезультатов[1].Выбрать();
	
	Пока ВыборкаДополнительныеНачисления.Следующий() Цикл
		
		НовСтрДопНачисления = Объект.ДополнительныеНачисления.Добавить();
		НовСтрДопНачисления.Сотрудник = ВыборкаДополнительныеНачисления.Сотрудник;
		НовСтрДопНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Процент;
		НовСтрДопНачисления.СуммаНачисления = ВыборкаДополнительныеНачисления.СуммаКОплатеПриход;
		НовСтрДопНачисления.НачисленоЧасов = ВыборкаДополнительныеНачисления.ЧасовКОплатеПриход;
		
	КонецЦикла;
	
	Пока ВыборкаОсновныеНачисления.Следующий() Цикл
		
		НовСтрОснНачисления = Объект.ОсновныеНачисления.Добавить();
		НовСтрОснНачисления.Сотрудник = ВыборкаОсновныеНачисления.Сотрудник;
		НовСтрОснНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
		НовСтрОснНачисления.ДатаНачала = НачалоМесяца;
		НовСтрОснНачисления.ДатаОкончания = КонецМесяца;
		НовСтрОснНачисления.ГрафикРаботы = ВыборкаОсновныеНачисления.ГрафикРаботы;
		
	КонецЦикла;
	
КонецПроцедуры
